"""
Необходимо создать (не программно) текстовый файл,
где каждая строка описывает учебный предмет и наличие лекционных,
практических и лабораторных занятий по этому предмету и их количество.
Важно, чтобы для каждого предмета не обязательно были все типы занятий.
Сформировать словарь, содержащий название предмета и общее количество занятий по нему.
Вывести словарь на экран.
Примеры строк файла:

Информатика: 100(л) 50(пр) 20(лаб).
Физика: 30(л) — 10(лаб)
Физкультура: — 30(пр) —
Пример словаря:

{“Информатика”: 170, “Физика”: 40, “Физкультура”: 30}
"""
export_dict = {}
with open("hw56.txt") as file:
    for l in file:
        lesson_type, *lessons = l.split()
        lesson_count = [int(lesson.rstrip('(Lec)(Fac)(Lab)')) for lesson in lessons if lesson != '-']
        export_dict.update({lesson_type.rstrip(":"): sum(lesson_count)})
print(export_dict)
